[
  {
    "id": 1,
    "title": "Forge Engine",
    "content": "<p><b>Forge Engine</b> — это кроссплатформенный игровой движок, созданный для разработки как <u>2D</u>, так и <u>3D</u> игр. Движок был написан летом 2025 года <i>Владиславом Плотниковым Артёмовичем</i>, 14-летним российским программистом-самоучкой. Основной код движка реализован на языке <b>Python</b>, при этом для написания игровой логики используется самописный скриптовый язык <b>Sharp (#Script, .shrp)</b>. Forge Engine распространяется свободно на бесплатной основе.</p><h2>История разработки</h2><p>Идея создания собственного игрового движка возникла у Владислава Плотникова в начале 2025 года как личный вызов и учебный проект. Разработка велась в течение летних месяцев, а первая публичная альфа-версия была выпущена в августе 2025 года. Несмотря на юный возраст автора, движок демонстрирует продуманную архитектуру, вдохновлённую такими системами, как Unity и Godot, но адаптированную для упрощённого освоения.</p><div class='info'><b>Примечание:</b> Forge Engine является проектом-одиночкой (solo project) и не связан с коммерческими организациями.</div><h2>Технические особенности</h2><h3>Архитектура и ядро</h3><p>Ядро движка, написанное на Python, отвечает за управление основными системами: циклом приложения, вводом данных, управлением сценами и объектами, а также за коммуникацию с низкоуровневыми API. Для рендера используется графический API <b>OpenGL</b>, что обеспечивает поддержку как 2D-спрайтов, так и 3D-моделей с базовыми материалами и освещением.</p><h3>Скриптовый язык Sharp (#Script)</h3><p>Основным средством разработки игр внутри движка является скриптовый язык <i>Sharp</i> (файлы с расширением .shrp). Это императивный язык с C-подобным синтаксисом, созданный специально для Forge Engine. Он предоставляет разработчику доступ к основным функциям движка: управление объектами (нодами), обработка физики (упрощённая), работа с анимациями и пользовательским вводом.</p><div class='warning'><b>Внимание:</b> Язык Sharp находится на ранней стадии развития, и его функционал может значительно меняться между версиями.</div><h3>Рабочий процесс и инструменты</h3><p>Forge Engine поставляется в виде набора Python-скриптов и среды выполнения. Разработчик создаёт проект, определяет сцены и объекты, а затем пишет логику на языке Sharp. Движок включает в себя базовый набор инструментов для управления ассетами (изображения, модели, звуки).</p><h3>Экспорт проектов</h3><p>Ключевой особенностью движка является возможность <u>экспорта готовой игры</u> в дистрибутив. В результате компиляции создаётся папка, содержащая исполняемый файл (.exe для Windows, с потенциальной поддержкой других ОС), все необходимые ассеты и скомпилированные скрипты, что позволяет распространять игру как самостоятельное приложение без зависимостей.</p><h2>Системные требования</h2><p>Для разработки игр требуется Python 3.9+. Для запуска экспортированных игр не требуется установленный Python, но необходимы соответствующие графические драйверы с поддержкой OpenGL.</p><h2>Критика и перспективы</h2><p>Как проект, созданный одним разработчиком-подростком, Forge Engine закономерно имеет ряд ограничений: отсутствие сложных инструментов для визуального редактирования, упрощённая физическая система и базовый рендеринг. Однако, простота освоения, бесплатность и активная поддержка создателя делают его перспективным решением для начинающих геймдев-энтузиастов и образовательных проектов.</p>"
  }
]
