[
  {
    "id": 1,
    "title": "Добро пожаловать!",
    "content": "<h2>Добро пожаловать в энциклопедию Flux Engine для разработчиков</h2>\n\n<h3>О движке</h3>\n<p><strong>Flux Engine</strong> — это модульный, легковесный игровой движок с открытой архитектурой, ориентированный на создание многопользовательских игр с высокой степенью кастомизации. Он предоставляет разработчикам гибкие инструменты для работы с визуализацией, сетевым кодом, интерфейсами и логикой игры.</p>\n\n<h3>Что вы найдёте в этой энциклопедии</h3>\n<p>Эта вики — ваш основной справочник по всем аспектам разработки на Flux Engine. В ней собраны:</p>\n<ul>\n  <li><strong>Базовые понятия</strong>: структура проекта, жизненный цикл сущностей, конфигурация.</li>\n  <li><strong>API-справочник</strong>: документация по скриптам, модулям и пользовательским расширениям.</li>\n  <li><strong>Интерфейс и UI</strong>: работа с визуальными элементами и шаблонами интерфейса.</li>\n  <li><strong>Сетевое взаимодействие</strong>: синхронизация состояний, RPC, защита от читов.</li>\n  <li><strong>Отладка и тестирование</strong>: советы по профилированию, логированию и тестам.</li>\n  <li><strong>Примеры и шаблоны</strong>: готовые рецепты для типичных задач.</li>\n</ul>\n\n<h3>Минимальные требования</h3>\n<div class=\"infobox\">\n  <p><strong>Инфо:</strong> Для запуска редактора требуется установленный Node.js версии 18+ и современный браузер с поддержкой WebGL 2.0.</p>\n</div>\n\n<h3>Полезные ссылки</h3>\n<ul>\n  <li><a href=\"https://example.com/download\" class=\"external-link\">Скачать Flux Engine</a></li>\n  <li><a href=\"?pageid=2\">Начало работы</a></li>\n  <li><a href=\"?pageid=3\">Структура проекта</a></li>\n  <li><a href=\"?pageid=faq\">Часто задаваемые вопросы</a></li>\n</ul>\n\n<div class=\"warningbox\">\n  <p><strong>Внимание:</strong> Некоторые функции Flux Engine находятся в стадии активной разработки и могут быть нестабильны. Используйте экспериментальные модули на свой страх и риск.</p>\n</div>\n\n<div class=\"info\">\n<p><strong>Подсказка:</strong> Используйте встроенный CLI<code>flux build</code><code>flux dev</code> для быстрой компиляции и запуска прототипов без необходимости вручную управлять зависимостями.</p>\n</div>"
  } 
]